Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.AnalysisModelSeismicProperties Property
 Gets or sets the analysis model seismic properties.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModelSeismicProperties AnalysisModelSeismicProperties { get; set; }
Public Property AnalysisModelSeismicProperties As AnalysisModelSeismicProperties
	Get
	Set
Property Value
Type: AnalysisModelSeismicProperties
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace